avr-rust/avrd/packs/atmega/AT90PWM3B.atdf
        <register caption="Output Compare 0 RB Register" name="OCR0RB" offset="0xD8" size="2">
          <bitfield caption="Output Compare RB" mask="0xFFFF" name="OCR0RB"/>
        </register>
        <register caption="Output Compare 0 SB Register" name="OCR0SB" offset="0xD6" size="2">
          <bitfield caption="Output Compare SB" mask="0x0FFF" name="OCR0SB"/>
        </register>
        <register caption="Output Compare 0 RA Register" name="OCR0RA" offset="0xD4" size="2">
          <bitfield caption="Output Compare RA" mask="0x0FFF" name="OCR0RA"/>
        </register>
        <register caption="Output Compare 0 SA Register" name="OCR0SA" offset="0xD2" size="2">
          <bitfield caption="Output Compare SA" mask="0x0FFF" name="OCR0SA"/>
        </register>
        <register caption="PSC0 Synchro and Output Configuration" name="PSOC0" offset="0xD0" size="1">
          <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC0"/>
          <bitfield caption="PSCOUT01 Output Enable" mask="0x04" name="POEN0B"/>
          <bitfield caption="PSCOUT00 Output Enable" mask="0x01" name="POEN0A"/>
        </register>
        <register caption="PSC0 Interrupt Mask Register" name="PIM0" offset="0xA1" size="1">
          <bitfield caption="PSC 0 Synchro Error Interrupt Enable" mask="0x20" name="PSEIE0"/>
          <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE0B"/>
          <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE0A"/>
          <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE0"/>
        </register>
        <register caption="PSC0 Interrupt Flag Register" name="PIFR0" offset="0xA0" size="1">
          <bitfield caption="PSC 0 Output A Activity" mask="0x80" name="POAC0B"/>
          <bitfield caption="PSC 0 Output A Activity" mask="0x40" name="POAC0A"/>
          <bitfield caption="PSC 0 Synchro Error Interrupt" mask="0x20" name="PSEI0"/>
          <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV0B"/>
          <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV0A"/>
          <bitfield caption="Ramp Number" mask="0x06" name="PRN0"/>
          <bitfield caption="End of PSC0 Interrupt" mask="0x01" name="PEOP0"/>
        </register>
      </register-group>
      <register-group caption="Power Stage Controller" name="PSC1">
        <register caption="PSC 1 Input Capture Register " name="PICR1" offset="0xEE" size="2">
          <bitfield caption="PSC 1 Input Capture Software Trig" mask="0x8000" name="PCST1"/>
          <bitfield caption="PSC 1 Input Capture Bytes" mask="0x0FFF" name="PICR1"/>
        </register>
        <register caption="PSC 1 Input B Control" name="PFRC1B" offset="0xED" size="1">
          <bitfield caption="PSC 1 Capture Enable Input Part B" mask="0x80" name="PCAE1B"/>
          <bitfield caption="PSC 1 Input Select for Part B" mask="0x40" name="PISEL1B"/>
          <bitfield caption="PSC 1 Edge Level Selector on Input Part B" mask="0x20" name="PELEV1B"/>
          <bitfield caption="PSC 1 Filter Enable on Input Part B" mask="0x10" name="PFLTE1B"/>
          <bitfield caption="PSC 1 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM1B"/>
        </register>
        <register caption="PSC 1 Input B Control" name="PFRC1A" offset="0xEC" size="1">
          <bitfield caption="PSC 1 Capture Enable Input Part A" mask="0x80" name="PCAE1A"/>
          <bitfield caption="PSC 1 Input Select for Part A" mask="0x40" name="PISEL1A"/>
          <bitfield caption="PSC 1 Edge Level Selector on Input Part A" mask="0x20" name="PELEV1A"/>
          <bitfield caption="PSC 1 Filter Enable on Input Part A" mask="0x10" name="PFLTE1A"/>
          <bitfield caption="PSC 1 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM1A"/>
        </register>
        <register caption="PSC 1 Control Register" name="PCTL1" offset="0xEB" size="1">
          <bitfield caption="PSC 1 Prescaler Selects" mask="0xC0" name="PPRE1"/>
          <bitfield caption="Balance Flank Width Modulation" mask="0x20" name="PBFM1"/>
          <bitfield caption="PSC 1 Asynchronous Output Control B" mask="0x10" name="PAOC1B"/>
          <bitfield caption="PSC 1 Asynchronous Output Control A" mask="0x08" name="PAOC1A"/>
          <bitfield caption="PSC1 Auto Run" mask="0x04" name="PARUN1"/>
          <bitfield caption="PSC1 Complete Cycle" mask="0x02" name="PCCYC1"/>
          <bitfield caption="PSC 1 Run" mask="0x01" name="PRUN1"/>
        </register>
        <register caption="PSC 1 Configuration Register" name="PCNF1" offset="0xEA" size="1">
          <bitfield caption="PSC 1 Fifty" mask="0x80" name="PFIFTY1"/>
          <bitfield caption="PSC 1 Autolock" mask="0x40" name="PALOCK1"/>
          <bitfield caption="PSC 1 Lock" mask="0x20" name="PLOCK1"/>
          <bitfield caption="PSC 1 Mode" mask="0x18" name="PMODE1"/>
          <bitfield caption="PSC 1 Output Polarity" mask="0x04" name="POP1"/>
          <bitfield caption="PSC 1 Input Clock Select" mask="0x02" name="PCLKSEL1"/>
        </register>
        <register caption="Output Compare RB Register " name="OCR1RB" offset="0xE8" size="2">
          <bitfield caption="Output Compare 1 RB" mask="0xFFFF" name="OCR1RB"/>
        </register>
        <register caption="Output Compare SB Register " name="OCR1SB" offset="0xE6" size="2">
          <bitfield caption="Output Compare 1 SB" mask="0x0FFF" name="OCR1SB"/>
        </register>
        <register caption="Output Compare RA Register " name="OCR1RA" offset="0xE4" size="2">
          <bitfield caption="Output Compare 1 RA" mask="0x0FFF" name="OCR1RA"/>
        </register>
        <register caption="Output Compare SA Register " name="OCR1SA" offset="0xE2" size="2">
          <bitfield caption="Output Compare 1 SA" mask="0x0FFF" name="OCR1SA"/>
        </register>
        <register caption="PSC1 Synchro and Output Configuration" name="PSOC1" offset="0xE0" size="1">
          <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC1_"/>
          <bitfield caption="PSCOUT11 Output Enable" mask="0x04" name="POEN1B"/>
          <bitfield caption="PSCOUT10 Output Enable" mask="0x01" name="POEN1A"/>
        </register>
